spells_1lvl = {
    "Chromatic Orb": {
        "damage": "3d8",
        "range": 10,
        "game_mechanics": "на экране появляется сетка такая же как и у аттаки рукой и он наносит урон в радиусе 2 клетки в каждую сторону от персоонажа."
    },
    
    "Magic Missile": {
        "damage": "3d3",
        "range": 1000,
        "game_mechanics": " выпускает 3 пули которые попадают с вероятностью 100%."
    },
    
    "Ice Knife": {
        "damage": "1d10",
        "range": 100,
        "game_mechanics": "игрок может выбрать на карте место вокруг которого появляется сетка из 9 клеток и это наносит спеш урон по всей этой области."
    },
    
    "Healing Word": {
        "healing": "1d4+3",
        "range": 1,
        "game_mechanics": "лечит на 1d4+3."
    },
    
    "Burning Hands": {
        "damage": "3d7",
        "range": 20,
        "game_mechanics": "игрок может выбрать на карте место вокруг которого появляется сетка из 9 клеток и это наносит спеш урон по всей этой области."
    },
    
    "Thunderwave": {
        "damage": "2d5",
        "range": 10000,
        "game_mechanics": "наносит урон всем на карте кроме персоонажа ."
    },
    
    "Grease": {
        "range": 60,
        "game_mechanics": "Игрок выбирает квадрат 10х10, падение при провале спасброска",
    },
    
    "Shield": {
        "range": 0,
        "duration": 1,
        "bonus_ac": 5,
        "description": "Magic shield"
    }
}

# Словарь с заклинаниями второго уровня
spells_2lvl = {
    "Scorching Ray": {
        "damage": "3d9",
        "range": 50,
        "game_mechanics": "наносит урон всем на карте кроме персоонажа ."
    },

    "Shatter": {
        "damage": "1d15",
        "range": 5,
        "game_mechanics": "наносит огромный урон в радиусе 1 клетки от персоонажа ."
    },

    "Dragon's Breath": {
        "damage": "2d7",
        "range": 20,
        "game_mechanics": "наносит урон + противник будет использовать следующую атаку с помехой ."
    },

    "Mirror Image": {
        "damage": "3d5",
        "range": 50,
        "game_mechanics": "создает копию персоонажа с 5 хп которая будет делать тоже самое что и персоонажа и наносить такой же урон ."
    },

    "Misty Step": {
        "damage": "0",
        "range": 10000,
        "game_mechanics": "перемещает персоонажа на любую клетку на карте."
    },

    "Cloud of Daggers": {
        "damage": "2d5",
        "range": 50,
        "game_mechanics": "создает зону по выбору игрока в которой все получают урон за каждый ход нахождения в ней ."
    },

    "Hold Person": {
        "damage": "0",
        "range": 100,
        "game_mechanics": "не дает противнику нечего делать до тех пор пока его не ударят ."
    },
}